<docs>
---
order: 0
title: 基本
---

带弹出提示基本的单行省略, 未超出时不显示tooltip。

</docs>

<template>
    <j-ellipsis style="max-width: 240px">
        水是眼波横 山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去
        若到江南赶上春 千万和春住 水是眼波横 山是眉峰聚 欲问行人去那边
        眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春 千万和春住 水是眼波横
        山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去
        若到江南赶上春 千万和春住水是眼波横 山是眉峰聚 欲问行人去那边 眉眼盈盈处
        才始送春归 又送君归去 若到江南赶上春 千万和春住 水是眼波横 山是眉峰聚
        欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春
        千万和春住水是眼波横 山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归
        又送君归去 若到江南赶上春 千万和春住水是眼波横 山是眉峰聚 欲问行人去那边
        眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春 千万和春住水是眼波横
        山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去
        若到江南赶上春 千万和春住水是眼波横 山是眉峰聚 欲问行人去那边 眉眼盈盈处
        才始送春归 又送君归去 若到江南赶上春 千万和春住水是眼波横 山是眉峰聚
        欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春
        千万和春住水是眼波横 山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归
        又送君归去 若到江南赶上春 千万和春住水是眼波横 山是眉峰聚 欲问行人去那边
        眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春 千万和春住水是眼波横
        山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去
        若到江南赶上春 千万和春住水是眼波横 山是眉峰聚 欲问行人去那边 眉眼盈盈处
        才始送春归 又送君归去 若到江南赶上春 千万和春住水是眼波横 山是眉峰聚
        欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春
        千万和春住水是眼波横 山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归
        又送君归去 若到江南赶上春 千万和春住水是眼波横 山是眉峰聚 欲问行人去那边
        眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春 千万和春住 水是眼波横
        山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去
        若到江南赶上春 千万和春住 水是眼波横 山是眉峰聚 欲问行人去那边
        眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春 千万和春住 水是眼波横
        山是眉峰聚 欲问行人去那边 眉眼盈盈处 才始送春归 又送君归去
        若到江南赶上春 千万和春住 水是眼波横 山是眉峰聚 欲问行人去那边
        眉眼盈盈处 才始送春归 又送君归去 若到江南赶上春 千万和春住
    </j-ellipsis>
    <j-ellipsis> 水是眼波横 山是眉峰聚 欲问行人去那边 眉眼盈盈处 </j-ellipsis>
</template>
